//$TESTLST JOB (Z904,0012),GERHARD,CLASS=E,MSGCLASS=C,MSGLEVEL=(1,1)
//*
//*      SAMPLE JOB TO SHOW USE OF DISASM TO RETRIEVE A DECK
//*      FROM A SAVED ASSEMBLER LISTING.
//*
//*      THIS WORKS BEST IF ORIGINAL ASSEMBLY IS RUN WITH
//*      PRINT ON,GEN,DATA (EXCEPTING SYSTEM MAPPING MACROS)
//*
//DISASM EXEC  PGM=DISASM,REGION=512K,TIME=1
//*STEPLIB  DD  DISP=SHR,DSN=GERHARD.TEST.LOADLIB
//*        DD  DISP=SHR,DSN=SYS1.ESPLIB
//*
//DISDEBUG DD  SYSOUT=*
//DISPRINT DD  SYSOUT=*
//DISPUNCH DD  SYSOUT=*
//DISLIST  DD  DISP=SHR,DSN=GERHARD.MVS.ESPLIST(SUBALLOC)
//DISIN    DD  *
MODULE   SUBALLOC
*ABEND
//*
//
